In [107]:
# importing libraries
import os
import numpy as np
import pandas as pd
import datetime as dt
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
print(os.getcwd())

C:\Users\lynkx\Python Projects\Ynap

In [3]:
data_path = os.path.join(os.getcwd(), 'ynap_data')
print(data_path)

C:\Users\lynkx\Python Projects\Ynap\ynap_data

In [5]:
print(os.listdir(data_path))

['account.csv', 'Thumbs.db', 'transactions.csv', '~$sk_overview.docx']

In [11]:
df_acc = pd.read_csv(data_path + '\\account.csv', sep=',')
df_acc.head()

   customer_id  var3  var4  var5  var6  lapsed_next_period
0       553547   3.0  0.34   0.0   0.0                   0
1       213578   3.0  0.11   0.0   0.0                   0
2       906135   3.0  0.05   0.0   0.0                   0
3       226782   2.0  0.01   0.0   0.0                   0
4       103600   2.0  0.33   1.0   0.0                   0

In [12]:
df_trans = pd.read_csv(data_path + '\\transactions.csv', sep=',')
df_trans.head()

,customer_id,order_id,order_date,var1,var2,product_id,product_type_id,designer_id,gross_spend,net_spend
0,553547,235052,1989-08-28,0,0,96141,66,2262,1.304,1.304
1,553547,235052,1989-08-28,0,0,965607,44,2288,0.015,0.015
2,213578,335391,1990-09-02,1,0,13263,139,322,0.328,0.000
3,213578,50811,1990-11-23,1,0,596855,188,578,0.095,0.095
4,213578,50811,1990-11-23,1,0,779370,188,578,0.081,0.081

In [34]:
# shape dataframes
print('account dataframe dim: ({:,}, {:,})'.format(df_acc.shape[0], df_acc.shape[1]))
print('transactions dataframe dim: ({:,}, {:,})'.format(df_trans.shape[0], df_trans.shape[1]))

account dataframe dim: (15,695, 6)
transactions dataframe dim: (1,447,780, 10)

In [18]:
# check if customers are distinct
df_acc['customer_id'].nunique()

15695

In [32]:
# chrun rate
print(df_acc['lapsed_next_period'].value_counts())
print('\nChurn rate: {:.2%}'.format(df_acc['lapsed_next_period'].sum() / df_acc['customer_id'].nunique()))

0    14874
1      821
Name: lapsed_next_period, dtype: int64

Churn rate: 5.23%

In [45]:
# convert order_date from str to datetime
df_trans['order_date'] = df_trans['order_date'].apply(lambda x: dt.datetime.strptime(x, '%Y-%m-%d'))

In [71]:
def get_periods(df):
    df['order_month'] = df['order_date'].apply(lambda x: str(x.date().year) + str(x.date().month).zfill(2))
    df['order_quarter'] = df['order_date'].apply(lambda x: str(x.date().year) + str((x.date().month-1)//3+1).zfill(2))
    
get_periods(df_trans)

In [72]:
df_trans['order_quarter'].value_counts()

199004    301889
199003    257913
199002    256592
198904    232792
199001    207910
198903    190684
Name: order_quarter, dtype: int64

In [68]:
df_trans['order_month'].value_counts()

199012    115152
199011    102444
199006     99990
199009     91969
199007     89412
198912     86968
199005     84450
199010     84293
198911     80499
199008     76532
199003     75876
199004     72152
199001     71029
198909     69139
198910     65325
199002     61005
198907     60957
198908     60588
Name: order_month, dtype: int64

In [52]:
# period of transactions
print('first transactions: {:%d %B %Y}'.format(df_trans['order_date'].min()))
print('last transactions: {:%d %B %Y}'.format(df_trans['order_date'].max()))
print(df_trans['order_date'].max()-df_trans['order_date'].min())

first transactions: 01 July 1989
last transactions: 30 December 1990
547 days 00:00:00

In [73]:
# get items returned
df_trans['item_returned'] = df_trans['net_spend'].apply(lambda x: 1 if x == 0 else 0)

In [74]:
df_trans.head()

,customer_id,order_id,order_date,var1,var2,product_id,product_type_id,designer_id,gross_spend,net_spend,order_month,order_quarter,item_returned
0,553547,235052,1989-08-28,0,0,96141,66,2262,1.304,1.304,198908,198903,0
1,553547,235052,1989-08-28,0,0,965607,44,2288,0.015,0.015,198908,198903,0
2,213578,335391,1990-09-02,1,0,13263,139,322,0.328,0.000,199009,199003,1
3,213578,50811,1990-11-23,1,0,596855,188,578,0.095,0.095,199011,199004,0
4,213578,50811,1990-11-23,1,0,779370,188,578,0.081,0.081,199011,199004,0

In [101]:
def get_counts_and_sums(df, grouping_columns='customer_id'):
    
    count_cols = ['order_id', 'var1', 'var2', 'product_id',
                  'product_type_id', 'designer_id']
    sum_cols = ['gross_spend', 'net_spend', 'item_returned']
    
    # maybe not necessary
    if type(grouping_columns) != list:
        glist = []
        glist.append(grouping_columns)
    else:
        glist = grouping_columns
   
    get_counts = df.groupby(glist)[count_cols].nunique().reset_index()
    get_sums = df.groupby(glist)[sum_cols].sum().reset_index()
    counts_and_sums = pd.merge(left=get_counts, right=get_sums, how='inner', on=glist)

    return counts_and_sums
            
tot_stats = get_counts_and_sums(df_trans)
monthly_stats = get_counts_and_sums(df_trans, ['customer_id', 'order_month'])
quarterly_stats = get_counts_and_sums(df_trans, ['customer_id', 'order_quarter'])

['customer_id']

In [102]:
tot_stats.head()

,customer_id,order_id,var1,var2,product_id,product_type_id,designer_id,gross_spend,net_spend,item_returned
0,79,2,1,1,3,2,3,1.615,1.615,0
1,156,23,1,2,47,18,29,21.494,17.449,8
2,192,2,1,1,4,2,3,3.820,2.592,3
3,198,24,1,2,44,19,39,50.313,24.516,27
4,278,26,2,2,47,11,23,40.175,29.081,9

In [105]:
monthly_stats.head(10)

,customer_id,order_month,order_id,var1,var2,product_id,product_type_id,designer_id,gross_spend,net_spend,item_returned
0,79,199010,1,1,1,1,1,1,0.174,0.174,0
1,79,199011,1,1,1,2,2,2,1.441,1.441,0
2,156,199006,3,1,1,6,4,4,2.282,1.936,1
3,156,199007,1,1,1,3,2,3,3.699,2.831,1
4,156,199008,7,1,2,22,11,12,5.212,4.615,4
5,156,199009,7,1,1,13,6,9,6.238,5.273,1
6,156,199010,2,1,1,2,2,2,1.216,1.216,0
7,156,199011,2,1,1,4,2,2,1.578,1.578,0
8,156,199012,1,1,1,1,1,1,1.269,0.000,1
9,192,199004,1,1,1,3,1,2,1.228,0.000,3

In [104]:
quarterly_stats.head()

,customer_id,order_quarter,order_id,var1,var2,product_id,product_type_id,designer_id,gross_spend,net_spend,item_returned
0,79,199004,2,1,1,3,2,3,1.615,1.615,0
1,156,199002,3,1,1,6,4,4,2.282,1.936,1
2,156,199003,15,1,2,34,15,21,15.149,12.719,6
3,156,199004,5,1,1,7,4,5,4.063,2.794,1
4,192,199002,1,1,1,3,1,2,1.228,0.000,3

In [106]:
df_acc[df_acc['customer_id'] == 156]

     customer_id  var3  var4  var5  var6  lapsed_next_period
607          156   2.0  0.03   0.0   0.0                   0